class Adventures::Reward < AdventurePart
  
  private
  
  def table
    table = []
    1.times { table << "Возможность быть незаметным в определенных кругах" }
    1.times { table << "Дополнительная форма передвижения" }
    1.times { table << "Лучшее обмундирование" }
    1.times { table << "Бонусы к спас броскам в определенных ситуациях" }
    1.times { table << "Лечение болезни" }
    1.times { table << "Улучшеная внимательность" }
    1.times { table << "Улучшеная возможность чтения заклинаний" }
    1.times { table << "Улучшеная возможность слышать" }
    1.times { table << "Улучшеная возможность видеть" }
    1.times { table << "Прибавка опыты и уровней" }
    1.times { table << "Прощение за прошлые поступки" }
    1.times { table << "Повышение очков здоровья" }
    1.times { table << "Улучшение физической внешности" }
    1.times { table << "Увеличение скорости действий" }
    1.times { table << "Увеличение боевой инициативы" }
    1.times { table << "Улучшение скорости движения" }
    1.times { table << "Улучшение классовой способности" }
    1.times { table << "Улучшение силы или другой характеристики" }
    1.times { table << "Понимание нового языка" }
    1.times { table << "Денежная выплата от покровителя" }
    1.times { table << "Разрешение на путешествие" }
    1.times { table << "Необходимое обмундирование" }
    1.times { table << "Полезная информация" }
    1.times { table << "Снятие проклятья" }
    1.times { table << "Омоложение" }
    1.times { table << "Бонусы на попадание в определенных ситуациях" }
    1.times { table << "Огромная куча сокровищ" }
    1.times { table << "Знаменитый драгоценный камень или драгоценности" }
    1.times { table << "Волшебный предмет" }
    1.times { table << "Легендарный волшебный предмет" }
    1.times { table << "Ценные документы и обязательства" }
    1.times { table << "Красивые украшения" }
    table
  end
end